# Заполните массив элементами арифметической прогрессии. Её первый элемент, разность и количество элементов нужно ввести
# с клавиатуры. Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.

# elem1 = int(input("Введите первое число:"))
# dif = int(input("Введите разность:"))
# num_elem = int(input("Введите количество чисел:"))
#
# num_list = []
# for i in range(0, num_elem):
#     if i == 0:
#         new_i = elem1
#     else:
#         new_i += dif
#     num_list.append(new_i)
#
# print(num_list)


# Задача 32: Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону
# т.е. не меньше заданного минимума и не больше заданного максимума)
#
# my_list = [2, 9, 0, 5, 3, 11]
# num_max = int(input("Введите максимальное число:"))
# num_min = int(input("Введите минимальное число:"))
#
# for i in range(0, len(my_list)):
#     if my_list[i] < num_max and my_list[i] > num_min:
#         print(i)
